#!/usr/bin/python
#-*- coding: utf-8 -*-
#===========================================================================
#=======================向列表中添加元素============================
#===========================================================================
#python的列表可以存放任何类型的数据（PS：PYTHON没有数据类型）
#C,C++的数组只能存放相同类型的数据
mixlist = ['kernal','nancy',3.14159,[1,2,3]]
print(mixlist)
print('\n')
#.append()将一个元素追加到列表的最后
mixlist.append('karel')
print(mixlist)
print('\n')
#.extend()将一个列表追加到列表的最后
mixlist.extend([23,78])
print(mixlist)
print('\n')
#.insert()往列表的特定位置插入一个元素
mixlist.insert(1,'fogger children')
print(mixlist)
print('\n')


#==========================================================================
#==========================从列表中删除元素=============================
#==========================================================================
print('===========================================================')
print('===========================================================')

#.remove()方法是将列表中存储的符合实参的值删除
mixlist.remove([1,2,3])
print(mixlist)
print('\n')

#.pop(index)方法是将列表中的索引值从列表中弹出，这方法是有返回值的，如果index不赋值
#则默认弹出列表最后的元素
a = mixlist.pop()
print(a)
print(mixlist)
print('\n')

b = mixlist.pop(0)
print(b)
print(mixlist)
print('\n')

#del（是语句(statement)和if,while一样，不是函数或者方法）语句 直接删除列表的元素，
#可以直接删除列表
del mixlist[3]
print(mixlist)
print('\n')
